---
kind: property
id: P:Autodesk.Revit.DB.PlanCircuit.IsRoomLocated
source: html/c8f370bd-6395-06c0-6221-7df52adeda81.htm
---
# Autodesk.Revit.DB.PlanCircuit.IsRoomLocated Property

Reports whether there is a room located in this circuit.

## Syntax (C#)
```csharp
public bool IsRoomLocated { get; }
```